blog/2016/10/07/swift/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Swift - L</title>
  <meta charset="utf-8" />
  <meta name="author" content="latpaw" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="&lt;TODO: insert your keywords here&gt;" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">L</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/blog/">Blog</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="https://github.com/latpaw">GitHub</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row">
        <div class="col-md-2"></div>
            <h1>Swift</h1>
            <div id="outline-container-org729f10c" class="outline-2">
<h2 id="org729f10c">swift</h2>
<div class="outline-text-2" id="text-org729f10c">
</div><div id="outline-container-org62cf8e3" class="outline-3">
<h3 id="org62cf8e3">closure</h3>
<div class="outline-text-3" id="text-org62cf8e3">
<div class="org-src-container">
<pre class="src src-swift">  func returnClosure() -&gt; ()-&gt;Int {
  func hello()-&gt; Int {
  return 10
  }
  return hello
  }

var names = ["hello","world","latpaw","wtf"];

names.sort({ (s1:String, s2: String) in return s1 &gt; s2})
names.sort({ s1, s2 in return s1 &gt; s2 })
names.sort({ s1, s2 in s1 &gt; s2})
names.sort({ $0 &gt; $1 })
names.sort() { $0 &gt; $1 }
names.sort {s1, s2 in return s1 &gt; s2}
names.sort(&gt;)
</pre>
</div>
<p>
autoclosure
var b : String { return "hello" }
</p>
</div>
</div>
<div id="outline-container-orge102439" class="outline-3">
<h3 id="orge102439">function</h3>
<div class="outline-text-3" id="text-orge102439">
<div class="org-src-container">
<pre class="src src-swift">func send(from person: Person, to anotherPerson: Person) -&gt; Bool {
print(person, anotherPerson)
}
send(from: me, to: obama)
func inc1(inout num: Int){
num += 1
}
var num = 10
inc1(&amp;num) // 相当于引用，可以在函数内部改变变量值
</pre>
</div>
</div>
</div>
<div id="outline-container-org33d6339" class="outline-3">
<h3 id="org33d6339">check api availability</h3>
<div class="outline-text-3" id="text-org33d6339">
<div class="org-src-container">
<pre class="src src-swift">if #available(iOS 9, OSX 10.10){
   // something for ios9
}else{
  // something for older ios
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb454947" class="outline-3">
<h3 id="orgb454947">guard</h3>
<div class="outline-text-3" id="text-orgb454947">
<p>
guard 一般是用来做赋值，带一个else表示赋值失败的时候执行
</p>
</div>
</div>
<div id="outline-container-org51e0157" class="outline-3">
<h3 id="org51e0157">enum</h3>
<div class="outline-text-3" id="text-org51e0157">
<p>
rawvalue
indirect
</p>
</div>
</div>
<div id="outline-container-orgc4d7607" class="outline-3">
<h3 id="orgc4d7607">class struct</h3>
</div>
<div id="outline-container-org1eb24ff" class="outline-3">
<h3 id="org1eb24ff">subscript</h3>
</div>
<div id="outline-container-org9e7ba32" class="outline-3">
<h3 id="org9e7ba32">for x in xs where x == "xxxx" {  }</h3>
</div>
</div>

    </div>
</section>


<footer id="footer">
    <br />
</footer>

  </body>
</html>
